# BuiltInFailures.MultiReferenceAnnotationFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MultiReferenceAnnotationFailures Class
BuiltInFailures Class Members See Also
---
Failures about MultiReferenceAnnotations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class MultiReferenceAnnotationFailures
```

Visual Basic
---
```text
Public NotInheritable Class MultiReferenceAnnotationFailures
```

Visual C++
---
```text
public ref class MultiReferenceAnnotationFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..MultiReferenceAnnotationFailures
# See Also
BuiltInFailures..::..MultiReferenceAnnotationFailures Members
Autodesk.Revit.DB Namespace